RT-Thread/rt-thread/bsp/nxp/mcx/mcxa/Libraries/MCXA153/MCXA153/drivers/fsl_spc.c
    status_t status = kStatus_Success;
    bool bandgapConfigured = false;
    spc_bandgap_mode_t curBandgapMode = SPC_GetActiveModeBandgapMode(base);

#if (defined(FSL_FEATURE_MCX_SPC_HAS_DCDC) && FSL_FEATURE_MCX_SPC_HAS_DCDC)
    if (((config->DCDCOption.DCDCDriveStrength) == kSPC_DCDC_NormalDriveStrength) && (bandgapConfigured == false))
    {
        if (curBandgapMode == kSPC_BandgapDisabled)
        {
            if ((config->bandgapMode) == kSPC_BandgapDisabled)
            {
                /* Bandgap must be enabled if any regulator attemp to work as normal drive strength. */
                return kStatus_SPC_BandgapModeWrong;
            }
            else
            {
                /* Set bandgap firstly, if current bandgap is disabled and attempt to set regulator as normal drive
                  strength. */
                base->LP_CFG = ((base->LP_CFG) & (~SPC_LP_CFG_BGMODE_MASK)) | SPC_LP_CFG_BGMODE(config->bandgapMode);
                bandgapConfigured = true;
            } 
        }
    }
#endif /* FSL_FEATURE_MCX_SPC_HAS_DCDC */

    if (((config->CoreLDOOption.CoreLDODriveStrength) == kSPC_CoreLDO_NormalDriveStrength) && (bandgapConfigured == false))
    {
        if (curBandgapMode == kSPC_BandgapDisabled)
        {
            if ((config->bandgapMode) == kSPC_BandgapDisabled)
            {
                /* Bandgap must be enabled if any regulator attemp to work as normal drive strength. */
                return kStatus_SPC_BandgapModeWrong;
            }
            else
            {
                /* Set bandgap firstly, if current bandgap is disabled and attempt to set regulator as normal drive
                  strength. */
                base->LP_CFG = ((base->LP_CFG) & (~SPC_LP_CFG_BGMODE_MASK)) | SPC_LP_CFG_BGMODE(config->bandgapMode);
                bandgapConfigured = true;
            } 
        }
    }

#if (defined(FSL_FEATURE_MCX_SPC_HAS_SYS_LDO) && FSL_FEATURE_MCX_SPC_HAS_SYS_LDO)
    if (((config->SysLDOOption.SysLDODriveStrength) == kSPC_SysLDO_NormalDriveStrength) && (bandgapConfigured == false))
    {
        if (curBandgapMode == kSPC_BandgapDisabled)
        {
            if ((config->bandgapMode) == kSPC_BandgapDisabled)
            {
                /* Bandgap must be enabled if any regulator attemp to work as normal drive strength. */
                return kStatus_SPC_BandgapModeWrong;
            }
            else
            {
                /* Set bandgap firstly, if current bandgap is disabled and attempt to set regulator as normal drive
                  strength. */
                base->LP_CFG = ((base->LP_CFG) & (~SPC_LP_CFG_BGMODE_MASK)) | SPC_LP_CFG_BGMODE(config->bandgapMode);
                bandgapConfigured = true;
            } 
        }
    }
#endif /* FSL_FEATURE_MCX_SPC_HAS_SYS_LDO */

#if (defined(FSL_FEATURE_MCX_SPC_HAS_DCDC) && FSL_FEATURE_MCX_SPC_HAS_DCDC)
    if ((uint8_t)config->DCDCOption.DCDCVoltage != (uint8_t)config->CoreLDOOption.CoreLDOVoltage)
    {
        /* Must specify the same level for both DCDC and CORE LDO, even if LDO_CORE is off. */
        return kStatus_SPC_CORELDOVoltageWrong;
    }
#endif /* FSL_FEATURE_MCX_SPC_HAS_DCDC */

    status = SPC_SetLowPowerModeCoreLDORegulatorConfig(base, &config->CoreLDOOption);
    if (status == kStatus_Success)
    {
#if (defined(FSL_FEATURE_MCX_SPC_HAS_SYS_LDO) && FSL_FEATURE_MCX_SPC_HAS_SYS_LDO)
        status = SPC_SetLowPowerModeSystemLDORegulatorConfig(base, &config->SysLDOOption);
#endif /* FSL_FEATURE_MCX_SPC_HAS_SYS_LDO */
        if (status == kStatus_Success)
        {
#if (defined(FSL_FEATURE_MCX_SPC_HAS_DCDC) && FSL_FEATURE_MCX_SPC_HAS_DCDC)
            status = SPC_SetLowPowerModeDCDCRegulatorConfig(base, &config->DCDCOption);
#endif /* FSL_FEATURE_MCX_SPC_HAS_DCDC */
            if (status == kStatus_Success)
            {
                if (bandgapConfigured == false)
                {
                    status = SPC_SetLowPowerModeBandgapmodeConfig(base, config->bandgapMode);
                }
                if (status == kStatus_Success)
                {
#if (defined(FSL_FEATURE_MCX_SPC_HAS_LPBUFF_EN_BIT) && FSL_FEATURE_MCX_SPC_HAS_LPBUFF_EN_BIT)
                    SPC_EnableLowPowerModeCMPBandgapBufferMode(base, config->lpBuff);
#endif /* FSL_FEATURE_MCX_SPC_HAS_LPBUFF_EN_BIT */
                    SPC_EnableLowPowerModeLowPowerIREF(base, config->lpIREF);
#if (defined(FSL_FEATURE_MCX_SPC_HAS_COREVDD_IVS_EN_BIT) && FSL_FEATURE_MCX_SPC_HAS_COREVDD_IVS_EN_BIT)
                    SPC_EnableLowPowerModeCoreVDDInternalVoltageScaling(base, config->CoreIVS);
#endif /* FSL_FEATURE_MCX_SPC_HAS_COREVDD_IVS_EN_BIT */
                }
            }
        }
    }

    return status;
}
